# Advent of Code: Day 6

In [15]:
import pandas as pd
import numpy as np
data = pd.read_csv ('six.txt', header=None)
data

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,1,1,1,2,1,5,1,1,2,1,...,1,1,1,1,5,1,1,1,2,1

In [16]:
data.T.value_counts()

1    207
2     30
3     22
5     22
4     19
dtype: int64

In [17]:
fish = pd.DataFrame(columns=[0,1,2,3,4,5,6,7,8])

In [18]:
fish

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8]
Index: []

In [19]:
fish.loc[0] = [0,207,30,22,19,22,0,0,0]

In [20]:
fish = fish.astype(int)
fish

   0    1   2   3   4   5  6  7  8
0  0  207  30  22  19  22  0  0  0

In [21]:
fish.shift(-1, axis=1)

     0   1   2   3   4  5  6  7   8
0  207  30  22  19  22  0  0  0 NaN

In [22]:
new_fish = pd.DataFrame(columns=[0,1,2,3,4,5,6,7,8])
new_fish.loc[0] = [0,0,0,0,0,0,0,0,0]
new_fish

   0  1  2  3  4  5  6  7  8
0  0  0  0  0  0  0  0  0  0

In [23]:
for i in range(256):
    new_fish = fish.shift(-1,axis=1)
    new_fish[0] = fish[1]
    new_fish[1] = fish[2]
    new_fish[2] = fish[3]
    new_fish[3] = fish[4]
    new_fish[4] = fish[5]
    new_fish[5] = fish[6]
    new_fish[6] = fish[7]
    new_fish[6] += fish[0]
    new_fish[7] = fish[8]
    new_fish[8] = fish[0] 
    fish= new_fish

In [24]:
fish

,0,1,2,3,4,5,6,7,8
0,146420535621,181966821442,187095553356,200982042686,238871757043,225243895868,293366118418,120046360025,160007475940

In [25]:
fish.sum(axis=1)

0    1754000560399
dtype: int64